In [24]:
### Importing Libraries, incl. Data Viz
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [25]:
### Create datapath to '02 Data'
datapath = r'/Users/gabrielconfrey/Desktop/Data Analysis/Career Foundry/Achievement 4/082023 Instacart Basket Analysis/02 Data'

In [26]:
# creating data path to '080223 Instacart Basket Analysis'
basketpath = r'/Users/gabrielconfrey/Desktop/Data Analysis/Career Foundry/Achievement 4/082023 Instacart Basket Analysis'

In [27]:
### Importing new dataset
customers = pd.read_csv(os.path.join(datapath, '1 Original Data', '4.9 Data Download', 'customers.csv'))

In [28]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [29]:
customers.shape

(206209, 10)

In [30]:
customers.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'STATE', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

## Renaming columns and checking changes

In [31]:
customers.rename(columns = {'First Name':'first name'}, inplace = True)

In [32]:
customers.rename(columns = {'Surnam':'last name'}, inplace = True)

In [33]:
customers.rename(columns = {'Gender':'gender'}, inplace = True)

In [34]:
customers.rename(columns = {'STATE':'state'}, inplace = True)

In [35]:
customers.rename(columns = {'Age':'age'}, inplace = True)

In [36]:
customers.rename(columns = {'n_dependants':'dependents'}, inplace = True)

In [37]:
### FINAL CHECK FOR COLUMNS
customers.columns

Index(['user_id', 'first name', 'last name', 'gender', 'state', 'age',
       'date_joined', 'dependents', 'fam_status', 'income'],
      dtype='object')

In [38]:
# Importing df 48_cleaned from 4.7
df = pd.read_pickle(os.path.join(datapath, '2 Prepared Data', '49_flagged.pkl'))

In [39]:
df.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'time_of_order', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'Unnamed: 0', 'product_name',
       'aisle_id', 'department_id', 'prices', 'price_range_loc',
       'traffic_level', 'traffic_level2', 'busiest_times',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'spending_flag',
       'median_ord_time', 'prior_order_flag'],
      dtype='object')

In [40]:
df.head()

,order_id,user_id,order_number,orders_day_of_week,time_of_order,days_since_prior_order,product_id,add_to_cart_order,reordered,Unnamed: 0,...,price_range_loc,traffic_level,traffic_level2,busiest_times,busiest_period_of_day,max_order,loyalty_flag,spending_flag,median_ord_time,prior_order_flag
0,2539329,1,1,2,8,7.0,196,1,0,195,...,Mid-range,Normal,Normal,Average,Average,10,New customer,Low spender,20.0,Regular customer
1,2398795,1,2,3,7,15.0,196,1,1,195,...,Mid-range,Normal,Least busy,Lowest,Fewest,10,New customer,Low spender,20.0,Regular customer
2,473747,1,3,3,12,21.0,196,1,1,195,...,Mid-range,Normal,Least busy,Busiest,Most orders,10,New customer,Low spender,20.0,Regular customer
3,2254736,1,4,4,7,29.0,196,1,1,195,...,Mid-range,Least busy,Least busy,Lowest,Fewest,10,New customer,Low spender,20.0,Regular customer
4,431534,1,5,4,15,28.0,196,1,1,195,...,Mid-range,Least busy,Least busy,Busiest,Most orders,10,New customer,Low spender,20.0,Regular customer

In [43]:
### Checking data types of customers columns
customers.dtypes

user_id         int64
first name     object
last name      object
gender         object
state          object
age             int64
date_joined    object
dependents      int64
fam_status     object
income          int64
dtype: object

In [44]:
### Dropping unnecessary customers columns and creating new df for cleaned version
custtrim = customers.drop(columns = ['date_joined','gender','state'])

In [45]:
custtrim.head()

   user_id first name last name  age  dependents fam_status  income
0    26711    Deborah  Esquivel   48           3    married  165665
1    33890   Patricia      Hart   36           0     single   59285
2    65803    Kenneth    Farley   35           2    married   99568
3   125935   Michelle     Hicks   40           0     single   42049
4   130797        Ann   Gilmore   26           1    married   40374

In [46]:
custtrim.rename(columns = {'fam_status':'marital_status'}, inplace = True)

In [47]:
custtrim.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int64
 1   first name      194950 non-null  object
 2   last name       206209 non-null  object
 3   age             206209 non-null  int64
 4   dependents      206209 non-null  int64
 5   marital_status  206209 non-null  object
 6   income          206209 non-null  int64
dtypes: int64(4), object(3)
memory usage: 11.0+ MB

### Checking for strange values

In [48]:
custtrim.describe()

             user_id            age     dependents         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

### Checking for missing values

In [50]:
custtrim.shape

(206209, 7)

In [51]:
custtrim['user_id'].value_counts(dropna=False)

user_id
26711     1
67322     1
173044    1
61044     1
98344     1
         ..
146847    1
154991    1
172193    1
184326    1
80148     1
Name: count, Length: 206209, dtype: int64

In [52]:
custtrim['first name'].value_counts(dropna=False)

first name
NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: count, Length: 208, dtype: int64

In [53]:
custtrim['last name'].value_counts(dropna=False)

last name
Hamilton      252
Randall       248
Lamb          243
Pennington    243
Barnett       242
             ...
Poole         172
Bauer         166
Pearson       164
Payne         163
Jordan        162
Name: count, Length: 1000, dtype: int64

In [54]:
custtrim['age'].value_counts(dropna=False)

age
19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: count, Length: 64, dtype: int64

In [55]:
custtrim['dependents'].value_counts(dropna=False)

dependents
0    51602
3    51594
1    51531
2    51482
Name: count, dtype: int64

In [56]:
custtrim['marital_status'].value_counts(dropna=False)

marital_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [57]:
custtrim['income'].value_counts(dropna=False)

income
57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: count, Length: 108012, dtype: int64

### Finding missing values

In [61]:
custtrim.isnull().sum()

user_id               0
first name        11259
last name             0
age                   0
dependents            0
marital_status        0
income                0
dtype: int64

In [62]:
### Because the missing values are in a str, it's appropriate to fill them with 'N/A'

In [63]:
custtrim['first name'].fillna("N/A", inplace = True)

In [64]:
custtrim.isnull().sum()

user_id           0
first name        0
last name         0
age               0
dependents        0
marital_status    0
income            0
dtype: int64

In [66]:
custtrim['first name'].value_counts()

first name
N/A        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: count, Length: 208, dtype: int64

### B/c N/A = NaN, missing value was properly filled.

### Next I need to check for duplicates in custtrim

In [68]:
custtrim.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

In [73]:
trim_dupe = custtrim[custtrim.duplicated()]

In [76]:
trim_dupe

Empty DataFrame
Columns: [user_id, first name, last name, age, dependents, marital_status, income]
Index: []

### There are no full duplicates in the df

### Next is to check for mixed type data

In [78]:
for col in custtrim.columns.tolist():
    weird = (custtrim[[col]].applymap(type) != custtrim[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (custtrim[weird]) > 0:
        print (col)

### No mixed type data exists in the df

## Next step is to combine the data sets on the primary key

In [79]:
df.head()

,order_id,user_id,order_number,orders_day_of_week,time_of_order,days_since_prior_order,product_id,add_to_cart_order,reordered,Unnamed: 0,...,price_range_loc,traffic_level,traffic_level2,busiest_times,busiest_period_of_day,max_order,loyalty_flag,spending_flag,median_ord_time,prior_order_flag
0,2539329,1,1,2,8,7.0,196,1,0,195,...,Mid-range,Normal,Normal,Average,Average,10,New customer,Low spender,20.0,Regular customer
1,2398795,1,2,3,7,15.0,196,1,1,195,...,Mid-range,Normal,Least busy,Lowest,Fewest,10,New customer,Low spender,20.0,Regular customer
2,473747,1,3,3,12,21.0,196,1,1,195,...,Mid-range,Normal,Least busy,Busiest,Most orders,10,New customer,Low spender,20.0,Regular customer
3,2254736,1,4,4,7,29.0,196,1,1,195,...,Mid-range,Least busy,Least busy,Lowest,Fewest,10,New customer,Low spender,20.0,Regular customer
4,431534,1,5,4,15,28.0,196,1,1,195,...,Mid-range,Least busy,Least busy,Busiest,Most orders,10,New customer,Low spender,20.0,Regular customer

In [80]:
custtrim.head()

   user_id first name last name  age  dependents marital_status  income
0    26711    Deborah  Esquivel   48           3        married  165665
1    33890   Patricia      Hart   36           0         single   59285
2    65803    Kenneth    Farley   35           2        married   99568
3   125935   Michelle     Hicks   40           0         single   42049
4   130797        Ann   Gilmore   26           1        married   40374

### Dfs will merge on 'user_id'

In [81]:
dfmerged = df.merge(custtrim, on = ['user_id'])

In [82]:
dfmerged.head()

,order_id,user_id,order_number,orders_day_of_week,time_of_order,days_since_prior_order,product_id,add_to_cart_order,reordered,Unnamed: 0,...,loyalty_flag,spending_flag,median_ord_time,prior_order_flag,first name,last name,age,dependents,marital_status,income
0,2539329,1,1,2,8,7.0,196,1,0,195,...,New customer,Low spender,20.0,Regular customer,Linda,Nguyen,31,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,195,...,New customer,Low spender,20.0,Regular customer,Linda,Nguyen,31,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,195,...,New customer,Low spender,20.0,Regular customer,Linda,Nguyen,31,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,195,...,New customer,Low spender,20.0,Regular customer,Linda,Nguyen,31,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,195,...,New customer,Low spender,20.0,Regular customer,Linda,Nguyen,31,3,married,40423

### Exporting merged df

In [83]:
# Export data to pkl
dfmerged.to_pickle(os.path.join(basketpath, '02 Data', '2 Prepared Data', '410_merged.pkl'))